spec/support/vcr_cassettes/preneeds/pre_need_applications/creates_a_pre_need_application.yml

---
http_interactions:
- request:
    method: post
    uri: "<PRENEEDS_HOST>/eoas_SOA/PreNeedApplicationPort"
    body:
      encoding: UTF-8
      string: <?xml version="1.0" encoding="UTF-8"?><env:Envelope xmlns:xsd="http://www.w3.org/2001/XMLSchema"
        xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:tns="http://service.soa.eoas.cem.va.gov/"
        xmlns:env="http://schemas.xmlsoap.org/soap/envelope/"><env:Body><tns:receivePreNeedApplication><preNeedRequest><applicant><applicantEmail>hg@hotmail.com</applicantEmail><applicantPhoneNumber>555-555-5555
        - 234</applicantPhoneNumber><applicantRelationshipToClaimant>Self</applicantRelationshipToClaimant><completingReason>I
        don&#39;t know</completingReason><mailingAddress><address1>31 West 51st Street</address1><city>NY</city><countryCode>US</countryCode><postalZip>10000</postalZip><state>NY</state></mailingAddress><name><firstName>first_name45</firstName><lastName>last_name45</lastName></name></applicant><applicationStatus></applicationStatus><claimant><address><address1>32
        West 51st Street</address1><city>NY</city><countryCode>US</countryCode><postalZip>10000</postalZip><state>NY</state></address><dateOfBirth>2001-01-31</dateOfBirth><desiredCemetery>400</desiredCemetery><name><firstName>first_name46</firstName><lastName>last_name46</lastName></name><relationshipToVet>1</relationshipToVet><ssn>123-45-6789</ssn></claimant><currentlyBuriedPersons><cemeteryNumber>400</cemeteryNumber><name><firstName>first_name47</firstName><lastName>last_name47</lastName></name></currentlyBuriedPersons><hasAttachments>false</hasAttachments><hasCurrentlyBuried>1</hasCurrentlyBuried><sendingApplication>vets.gov</sendingApplication><sendingCode></sendingCode><sentTime>2017-07-08T04:34:12Z</sentTime><trackingNumber>kXhZW749Jgj7rRcB8PVG</trackingNumber><veteran><address><address1>33
        West 51st Street</address1><city>NY</city><countryCode>US</countryCode><postalZip>10000</postalZip><state>NY</state></address><currentName><firstName>first_name48</firstName><lastName>last_name48</lastName></currentName><gender>Male</gender><isDeceased>unsure</isDeceased><maritalStatus>Married</maritalStatus><militaryServiceNumber>123456789</militaryServiceNumber><serviceName><firstName>first_name49</firstName><lastName>last_name49</lastName></serviceName><serviceRecords><branchOfService>AF</branchOfService><dischargeType>1</dischargeType></serviceRecords><ssn>123-45-6789</ssn><vaClaimNumber>123456789</vaClaimNumber><militaryStatus>A</militaryStatus></veteran></preNeedRequest></tns:receivePreNeedApplication></env:Body></env:Envelope>
    headers:
      Accept:
      - text/xml;charset=UTF-8
      Content-Type:
      - text/xml;charset=UTF-8
      User-Agent:
      - Vets.gov Agent
      Date:
      - Sat, 08 Jul 2017 04:34:12 GMT
      Content-Length:
      - '2423'
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
  response:
    status:
      code: 200
      message: OK
    headers:
      Date:
      - Sat, 08 Jul 2017 04:34:17 GMT
      Transfer-Encoding:
      - chunked
      Content-Type:
      - multipart/related;start="<rootpart*c210df99-6693-4351-8c97-353234b47c9d@example.jaxws.sun.com>";type="application/xop+xml";boundary="uuid:c210df99-6693-4351-8c97-353234b47c9d";start-info="text/xml"
    body:
      encoding: UTF-8
      string: "--uuid:c210df99-6693-4351-8c97-353234b47c9d\r\nContent-Id: <rootpart*c210df99-6693-4351-8c97-353234b47c9d@example.jaxws.sun.com>\r\nContent-Type:
        application/xop+xml;charset=utf-8;type=\"text/xml\"\r\nContent-Transfer-Encoding:
        binary\r\n\r\n<?xml version='1.0' encoding='UTF-8'?><S:Envelope xmlns:S=\"http://schemas.xmlsoap.org/soap/envelope/\"><S:Body><ns2:receivePreNeedApplicationResponse
        xmlns:ns2=\"http://service.soa.eoas.cem.va.gov/\"><return><applicationUUID>61795cbc-f969-44cc-abdc-ddb717b8b069</applicationUUID><returnCode>200</returnCode><returnDescription>PreNeed
        Application received.</returnDescription></return></ns2:receivePreNeedApplicationResponse></S:Body></S:Envelope>\r\n--uuid:c210df99-6693-4351-8c97-353234b47c9d--"
    http_version: 
  recorded_at: Sat, 08 Jul 2017 04:34:12 GMT
recorded_with: VCR 3.0.3
